# CantEditWhileGrouped Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CantEditWhileGrouped Property
BuiltInFailures..::..FamilyFailures Class See Also
---
You may not edit this parameter while the element is grouped.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CantEditWhileGrouped { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CantEditWhileGrouped As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CantEditWhileGrouped {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace